# Задача 3. Обычный день на работе
# Максим программирует целый день на работе и вечером идёт домой. Каждый час начальство кидает ему несколько задач, которые нужно решить до следующего рабочего часа. Вдобавок каждый час Максиму звонит супруга. Он знает, что если возьмёт трубку, то жена попросит зайти вечером в магазин.
#
# Что нужно сделать
# Напишите программу, в которой считается, сколько задач выполнил Максим за день (восемь часов). Если он хотя бы раз взял трубку, то в конце дополнительно выводите сообщение: «Нужно зайти в магазин».
#
# Дополнительно: сделайте так, чтобы жена не звонила Максиму, если он уже хотя бы раз ответил на звонок в течение рабочего дня.
#
# Примеры работы программы
#
# Пример 1 (основная задача)
#
# Пример 2 (с дополнительным условием)
#
# Начался восьмичасовой рабочий день.
#
# 1-й час
#
# Сколько задач решит Максим? 1
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# 2-й час
#
# Сколько задач решит Максим? 2
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# 3-й час
#
# Сколько задач решит Максим? 3
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# 4-й час
#
# Сколько задач решит Максим? 4
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 1
#
# 5-й час
#
# Сколько задач решит Максим? 5
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# 6-й час
#
# Сколько задач решит Максим? 1
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# 7-й час
#
# Сколько задач решит Максим? 2
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 1
#
# 8-й час
#
# Сколько задач решит Максим? 3
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# Рабочий день закончился. Всего выполнено задач: 21
#
# Нужно зайти в магазин.
#
# Начался восьмичасовой рабочий день.
#
# 1-й час
#
# Сколько задач решит Максим? 1
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 0
#
# 2-й час
#
# Сколько задач решит Максим? 2
#
# Звонит жена. Взять трубку? (1 — да, 0 — нет): 1
#
# 3-й час
#
# Сколько задач решит Максим? 1
#
# 4-й час
#
# Сколько задач решит Максим? 2
#
# 5-й час
#
# Сколько задач решит Максим? 3
#
# 6-й час
#
# Сколько задач решит Максим? 4
#
# 7-й час
#
# Сколько задач решит Максим? 1
#
# 8-й час
#
# Сколько задач решит Максим? 1
#
# Рабочий день закончился. Всего выполнено задач: 15
#
# Нужно зайти в магазин.
#
# Что оценивается
# Формат вывода соответствует примеру.
# Число итераций не превосходит число рабочих часов.
# Используется флаг для учёта факта звонка жены.
#
print('Начался восьмичасовой рабочий день.')

total_task = 0
hour = 1
need_shop = False

while hour < 8:
    print(hour, '-й час')
    task = int(input('Сколько задач решит Максим? '))
    total_task += task

    call = int(input('Звонит жена. Взять трубку? (1 — да, 0 — нет): '))
    if call == 1:
        need_shop = True
    hour += 1
print('Рабочий день закончился. Всего выполнено задач: ', total_task)
if need_shop:
    print('Нужно зайти в магазин.')

# Принято
