Задача 4. Великий и могучий
Паоло изучает русский язык: занимается по учебникам, читает книги, слушает музыку. Ему особенно понравилась книга «Преступление и наказание». Паоло решил найти самое длинное слово в этой книге, чтобы сравнить его с аналогом на своём языке.

Что нужно сделать
Напишите программу, которая получает на вход текст и находит длину самого длинного слова в нём. Слова в тексте разделяются одним пробелом.

Пример

Введите текст: Меня зовут Пётр.
Самое длинное слово, букв: 5.

Введите текст: Меня зовут Василий
Самое длинное слово, 7 букв

Рекомендации по выполнению
При помощи функции print убедитесь, что счётчики обнуляются в нужный момент.
Помните, что не все условия можно собирать в один условный блок. Некоторые из них должны срабатывать независимо друг от друга.
Что оценивается
Результат вывода соответствует условию.
Вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).

Решение:

bigger_summ = 0
summ = 0

text = input('Введите текст: ')

for symbol in text:
    if symbol != ' ':
        summ += 1
    else:
        summ = 0
    if summ > bigger_summ:
        bigger_summ = summ

print('Самое длинное слово, букв: ', bigger_summ)